exports/physics/rotation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-16 Mon 17:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rotation</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Rotation</h1>
<p>
Moment of inertia
</p>

<p>
\[
I = \int r^2 dm
\]
\[
I=I_{com} + Mh^2
\]
</p>

<div id="outline-container-org22ec865" class="outline-2">
<h2 id="org22ec865"><span class="section-number-2">1</span> Common formulae</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org44c375c" class="outline-3">
<h3 id="org44c375c"><span class="section-number-3">1.1</span> Rotational Inertia through central axis of hoop</h3>
<div class="outline-text-3" id="text-1-1">
<p>
\[
I = MR^2
\]
</p>
</div>
</div>

<div id="outline-container-org485099e" class="outline-3">
<h3 id="org485099e"><span class="section-number-3">1.2</span> RI through central axis of an annular cylinder</h3>
<div class="outline-text-3" id="text-1-2">
<p>
\[
I = \frac{1}{2}M(R_1^2+R_2^2)
\]
</p>
</div>
</div>

<div id="outline-container-org2af0fc8" class="outline-3">
<h3 id="org2af0fc8"><span class="section-number-3">1.3</span> Solid cylinder about central axis</h3>
<div class="outline-text-3" id="text-1-3">
<p>
\[
I = \frac{1}{2}MR^2
\]
</p>
</div>
</div>

<div id="outline-container-org048a1f8" class="outline-3">
<h3 id="org048a1f8"><span class="section-number-3">1.4</span> Solid cylinder about central diameter</h3>
<div class="outline-text-3" id="text-1-4">
<p>
\[
I = \frac{1}{2}MR^2 + \frac{1}{12}ML^2
\]
</p>
</div>
</div>

<div id="outline-container-org163f268" class="outline-3">
<h3 id="org163f268"><span class="section-number-3">1.5</span> Thin rod about central diameter</h3>
<div class="outline-text-3" id="text-1-5">
<p>
\[
I = \frac{1}{12}ML^2
\]
</p>
</div>
</div>

<div id="outline-container-orge82b4a4" class="outline-3">
<h3 id="orge82b4a4"><span class="section-number-3">1.6</span> Solid cylinder about diameter</h3>
<div class="outline-text-3" id="text-1-6">
<p>
\[
I = \frac{2}{5}MR^2
\]
</p>
</div>
</div>

<div id="outline-container-org2211c7c" class="outline-3">
<h3 id="org2211c7c"><span class="section-number-3">1.7</span> Thin spherical shell about any diameter</h3>
<div class="outline-text-3" id="text-1-7">
<p>
\[
I = \frac{2}{3}MR^2
\]
</p>
</div>
</div>

<div id="outline-container-org1ad0c69" class="outline-3">
<h3 id="org1ad0c69"><span class="section-number-3">1.8</span> Hoop about diameter</h3>
<div class="outline-text-3" id="text-1-8">
<p>
\[
I = \frac{1}{2}MR^2
\]
</p>
</div>
</div>

<div id="outline-container-org9580bcd" class="outline-3">
<h3 id="org9580bcd"><span class="section-number-3">1.9</span> Slab about center</h3>
<div class="outline-text-3" id="text-1-9">
<p>
\[
I = \frac{1}{12}M(l^2 + w^2)
\]
</p>
</div>
</div>
</div>

<div id="outline-container-orge2deb93" class="outline-2">
<h2 id="orge2deb93"><span class="section-number-2">2</span> Newton's second law for rotation</h2>
<div class="outline-text-2" id="text-2">
<p>
\[
\tau_{net} =I\alpha
\]
</p>
</div>
</div>

<div id="outline-container-orgd5a2f6d" class="outline-2">
<h2 id="orgd5a2f6d"><span class="section-number-2">3</span> Work and rotational kinetic energy</h2>
<div class="outline-text-2" id="text-3">
<p>
\[
W = \int_{\theta_i}^{\theta_f} \tau \dd{\theta}
\]
</p>

<p>
if \(\tau\) is constant, its just
</p>

<p>
\[
W=\tau(\theta_f-\theta_i)
\]
</p>


<p>
\[
P=\tau \omega
\]
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-08-16 Mon 17:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
